require 'activesupport'

class Ranglicize
  @@character_table = {
    'ae' => %w(æ ǽ ǣ ӕ),
    'AE' => %w(Ǽ Æ ᴭ ᴁ Ӕ Ǣ),
    'ss' => %w(ß),
    'ij' => %w(ĳ),
    'IJ' => %w(Ĳ),
    'oe' => %w(œ),
    'OE' => %w(Œ),
    'oy' => %w( ѹ),
    'OY' => %w( Ѹ),
    'eu' => %w(ᴂ),
    'ue' => %w(ᵫ),
    'a'  => %w(ᾶ ᾷ ᾰ ᾱ ᾲ ᾳ ᾴ ᾀ ᾁ ᾂ ᾃ ᾄ ᾅ ᾆ ᾇ ὰ ά ἀ ἁ ἂ ἃ ἄ ἅ ἆ ἇ ᵃ ᵄ ᵅ ₐ à á â ã ä å ǟ ǡ ǻ ȁ ȃ α ά а ᶏ ḁ ạ ả ấ ầ ẩ ẫ ậ ắ ằ ẳ ẵ ặ),
    'A'  => %w(Å Ᾰ Ᾱ Ὰ Ά ᾼ ᾈ ᾉ ᾊ ᾋ ᾌ ᾍ ᾎ ᾏ Ἀ Ἁ Ἂ Ἃ Ἄ Ἅ Ἆ Ἇ ᴬ ᴀ À Á Â Ã Ä Å Ā Ă Ą Ǟ Ǡ Ǻ Ȁ Ȃ Ȧ Ⱥ Ά Α А Ӑ Ӓ Ꭺ Ḁ Ạ Ả Ấ Ầ Ẩ Ẫ Ậ Ắ Ằ Ẳ Ẵ Ặ),
    'e'  => %w(ȅ ₔ ₑ ℯ ℮ ᵉ ᵊ ē ĕ ė ę ě Ə ǝ ȅ ȇ ȩ ɇ ɘ ə ɚ е ѐ ё ҽ Ҿ ҿ ӗ Ә ә Ӛ ӛ ᶒ ᶕ ḕ ḗ ḙ ḛ ḝ ẹ ẻ ẽ ế ề ể ễ ệ),
    'E'  => %w(ℰ ℇ ℈ Ὲ Έ ὲ έ Ἐ Ἑ Ἒ Ἓ Ἔ Ἕ ἐ ἑ ἒ ἓ ἔ ἕ ᴇ ᴈ ɛ ɜ ɝ є ε ϵ ϶ È ᶔ É Ê Ë Ē Ĕ Ė Ę Ě Ǝ Ȅ Ȇ Ȩ Ɇ Έ Ε ε έ ϵ Ѐ Ё Є Е Ӗ Ԑ Ꭼ ᴱ Ḕ Ḗ Ḙ Ḛ Ḝ),
    'i'  => %w(ῖ ῗ ῐ ῑ ῒ ΐ ὶ ί ἰ ἱ ἲ ἳ ἴ ἵ ἶ ἷ ᵢ ᵎ ì ᴉ í î ï ĩ ī ĭ į ı ǐ ȉ ȋ ɨ ΐ ί ϊ і ї Ꭵ ᶖ ᶤ ḭ ḯ ỉ Ị ị),
    'I'  => %w(Ῐ Ῑ Ὶ Ί Ἰ Ἱ Ἲ Ἳ Ἴ Ἵ Ἶ Ἷ Ì Í Î Ï Ĩ Ī Ĭ Į İ Ǐ Ȉ Ȋ ɪ Ι Ϊ І Ї Ӏ Ꮀ ᴵ Ḭ Ḯ Ỉ Ị),
    'o'  => %w(ₒ ὸ ό ὀ ὁ ὂ ὃ ὄ ὅ ò ó ô õ ö ø ō ŏ ő ǒ ǿ ȍ ȏ ȫ ȭ ȯ ȱ ɵ οо ӧ ө ӫ ᶱ ṍ ṏ ṑ ṓ ọ ỏ ố ồ ổ ỗ ộ),
    'O'  => %w(Ὸ Ό Ὀ Ὁ Ὂ Ὃ Ὄ Ὅ ᵒ Ò Ó Ô Õ Ö Ø Ō Ŏ Ő Ɵ Ǒ Ǿ Ȍ Ȏ Ȫ Ȭ Ȯ Ȱ ʘ Ό Θ Ο О Ѳ Ѻ Ӧ Ө Ӫ Ꮎ ᴏ ᴼ Ṍ Ṏ Ṑ Ṓ Ọ Ỏ Ố Ồ Ổ Ỗ Ộ),
    'u'  => %w(ᵘ ᵤ ù ú û ü ũ ū ŭ ů ű ų ǔ ǖ ǘ ǚ ǜ ȕ ȗ ʉ ʊ μ ᶸ ṳ ṵ ṷ ṹ ṻ ṳ ṵ ṷ ṹ ṻ ụ ủ ứ ừ ử ữ ự),
    'U'  => %w(ᵁ ᴜ Ù Ú Û Ü Ũ Ū Ŭ Ů Ű Ų Ư Ǔ Ǖ Ǘ Ǚ Ǜ Ȕ Ȗ Ʉ Ҵ Ṳ Ṵ Ṷ Ṹ Ṻ Ụ Ủ Ứ Ừ Ử Ữ Ự)
  }

  def initialize
  end
  
  def anglicize(characters="")
    @@character_table.each_pair { |k,v|
      regex = /#{v.split(' ').join('|')}/
      characters.gsub!(regex, k.strip)
    }
    return characters
  end

end

